app/views/questions/index.html.erb

SELECT "choices".* FROM "choices" WHERE "choices"."question_id" = $1  [["question_id", 1]]
---
      <ul>
        <% question.choices.each do |choice| %>