app/views/questions/show.html.erb

<ul>
  <% @question.choices.find_each do |choice| %>
---
SELECT  "choices".* FROM "choices" WHERE "choices"."question_id" = $1 ORDER BY "choices"."id" ASC LIMIT $2  [["question_id", 1], ["LIMIT", 1000]]