app/controllers/choices_controller.rb

  def create
    @question = Question.find(params[:question])
    text = params[:text]
    correct = params[:correct] == '1'
    new = Choice.create(:text =>text, :correct => correct, :question_id => @question.id)
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
INSERT INTO "choices" ("text", "correct", "question_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["text", "15"], ["correct", 0], ["question_id", 8], ["created_at", "2017-06-07 02:21:45.804836"], ["updated_at", "2017-06-07 02:21:45.804836"]]

  def destroy
    @question = Question.find(params[:question])
    @choice = Choice.find(params[:choice])
    @choice.destroy
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
SELECT  "choices".* FROM "choices" WHERE "choices"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
DELETE FROM "choices" WHERE "choices"."id" = $1  [["id", 13]]