app/controllers/questions_controller.rb

  def create
    @question = Question.new(params_question)
    respond_to do |format|
      if @question.save
---
INSERT INTO "questions" ("text", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["text", "Como te llamas?"], ["created_at", "2017-06-05 06:11:21.629628"], ["updated_at", "2017-06-05 06:11:21.629628"]]